# SQL Practice Problems: 57 beginning, intermediate, and advanced challenges for you to solve using a “learn-by-doing” approach

- This notebook contains my solution for SQL practice problems from [SPP 57 book](https://www.amazon.com/SQL-Practice-Problems-learn-doing-ebook/dp/B01N41VQFO)

# Connecting to MS SQL DB

In [1]:
import pyodbc
import pandas as pd
import os

In [2]:
class db_connection:
    def __new__(self):
        if not hasattr(self,'instance'):
            self.instance = super(db_connection, self).__new__(self)
            self.conn = pyodbc.connect('Driver={SQL Server};'
                      f'Server={os.environ["MSSQL_SERVER"]};'
                      'Database=Northwind_SPP;'
                      'Trusted_Connection=yes;')
        return self.instance
    
    def get_conn(self):
        return self.conn

## Execute query using cursor object

In [3]:
connection = db_connection()
conn = connection.get_conn()
cursor = conn.cursor()
cursor.execute("""
    SELECT * FROM shippers
""")

for row in cursor:
    print(row)

(1, 'Speedy Express', '(503) 555-9831')
(2, 'United Package', '(503) 555-3199')
(3, 'Federal Shipping', '(503) 555-9931')

## Execute query using pd.read_sql_query()

In [4]:
sql_query = pd.read_sql_query('SELECT * FROM shippers', conn)
print(sql_query)
print(type(sql_query))

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931
<class 'pandas.core.frame.DataFrame'>

- Query result in pandas dataframe looks better, so I'm going to use this approach to execute query and validate result
- Let's make a helper function to execute sql query and print result in pandas data frame

In [3]:
def sql(query : str)->None:
    """
    Take query as an argument, execute it and print the query result
    
    Arguments:
    query -> string type. Query to execute
    """
    result = pd.read_sql_query(query, db_connection().get_conn())
    print(result)

In [4]:
sql("""SELECT * FROM shippers""")

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

# DB Diagram for Practice Database
![ERD](ERD.PNG)

# Introductory Problems
## 1. Which shippers do we have?

In [7]:
sql("""
    SELECT * FROM shippers
""")

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

## 2. Certain fields from categories

In [8]:
sql("""
    SELECT CategoryName, Description FROM Categories
""")

     CategoryName                                        Description
0       Beverages        Soft drinks, coffees, teas, beers, and ales
1      Condiments  Sweet and savory sauces, relishes, spreads, an...
2     Confections                Desserts, candies, and sweet breads
3  Dairy Products                                            Cheeses
4  Grains/Cereals                Breads, crackers, pasta, and cereal
5    Meat/Poultry                                     Prepared meats
6         Produce                          Dried fruit and bean curd
7         Seafood                                   Seaweed and fish

## 3. Sales Representatives

In [6]:
sql("""
    SELECT FirstName, LastName, HireDate FROM Employees
    WHERE Title = 'Sales Representative'
""")

  FirstName   LastName   HireDate
0     Nancy    Davolio 2010-05-01
1     Janet  Leverling 2010-04-01
2  Margaret    Peacock 2011-05-03
3   Michael     Suyama 2011-10-17
4    Robert       King 2012-01-02
5      Anne  Dodsworth 2012-11-15

## 4. Sales Representatives in the United States

In [11]:
sql("""SELECT DISTINCT Country FROM Employees""")

  Country
0      UK
1     USA

In [12]:
sql("""
    SELECT FirstName, LastName, HireDate From Employees
    WHERE Title = 'Sales Representative' and Country = 'USA'
""")

  FirstName   LastName   HireDate
0     Nancy    Davolio 2010-05-01
1     Janet  Leverling 2010-04-01
2  Margaret    Peacock 2011-05-03

## 5. Orders Placed by Specific Employee ID

In [13]:
sql("""
    SELECT OrderID, OrderDate FROM Orders
    WHERE EmployeeID = 5
""")

    OrderID           OrderDate
0     10248 2014-07-04 08:00:00
1     10254 2014-07-11 02:00:00
2     10269 2014-07-31 00:00:00
3     10297 2014-09-04 21:00:00
4     10320 2014-10-03 12:00:00
5     10333 2014-10-18 18:00:00
6     10358 2014-11-20 05:00:00
7     10359 2014-11-21 14:00:00
8     10372 2014-12-04 10:00:00
9     10378 2014-12-10 00:00:00
10    10397 2014-12-27 17:00:00
11    10463 2015-03-04 13:00:00
12    10474 2015-03-13 16:00:00
13    10477 2015-03-17 02:00:00
14    10529 2015-05-07 01:00:00
15    10549 2015-05-27 03:00:00
16    10569 2015-06-16 15:00:00
17    10575 2015-06-20 22:00:00
18    10607 2015-07-22 09:00:00
19    10648 2015-08-28 22:00:00
20    10649 2015-08-28 00:00:00
21    10650 2015-08-29 06:00:00
22    10654 2015-09-02 07:00:00
23    10675 2015-09-19 06:00:00
24    10711 2015-10-21 03:00:00
25    10714 2015-10-22 03:00:00
26    10721 2015-10-29 08:00:00
27    10730 2015-11-05 07:00:00
28    10761 2015-12-02 08:00:00
29    10812 2016-01-02 02:00:00
30    10823 2016-01-09 17:00:00
31    10841 2016-01-20 21:00:00
32    10851 2016-01-26 00:00:00
33    10866 2016-02-03 01:00:00
34    10869 2016-02-04 09:00:00
35    10870 2016-02-04 12:00:00
36    10872 2016-02-05 06:00:00
37    10874 2016-02-06 14:00:00
38    10899 2016-02-20 09:00:00
39    10922 2016-03-03 02:00:00
40    10954 2016-03-17 16:00:00
41    11043 2016-04-22 17:00:00

## 6. Suppliers and ContactTitles

In [14]:
sql("""
    SELECT SupplierID, ContactName, ContactTitle
    FROM Suppliers
    WHERE ContactTitle != 'Marketing Manager'
""")

    SupplierID                 ContactName                  ContactTitle
0            1            Charlotte Cooper            Purchasing Manager
1            2               Shelley Burke           Order Administrator
2            3               Regina Murphy          Sales Representative
3            5  Antonio del Valle Saavedra          Export Administrator
4            6                 Mayumi Ohno      Marketing Representative
5            8                Peter Wilson          Sales Representative
6            9               Lars Peterson                   Sales Agent
7           11               Petra Winkler                 Sales Manager
8           12                 Martin Bein  International Marketing Mgr.
9           13               Sven Petersen   Coordinator Foreign Markets
10          14                  Elio Rossi          Sales Representative
11          16               Cheryl Saylor         Regional Account Rep.
12          17               Michael Björn          Sales Representative
13          18              Guylène Nodier                 Sales Manager
14          19               Robb Merchant       Wholesale Account Agent
15          20                Chandra Leka                         Owner
16          21              Niels Petersen                 Sales Manager
17          22                 Dirk Luchte            Accounting Manager
18          23              Anne Heikkonen               Product Manager
19          24             Wendy Mackenzie          Sales Representative
20          26            Giovanni Giudici           Order Administrator
21          27              Marie Delamare                 Sales Manager
22          28                  Eliane Noz          Sales Representative
23          29              Chantal Goulet            Accounting Manager

## 7. Products with "queso" in ProductName

In [20]:
sql("""
    SELECT ProductID, ProductName
    FROM Products
    WHERE LOWER(ProductName) LIKE '%queso%'
""")

   ProductID                ProductName
0         11             Queso Cabrales
1         12  Queso Manchego La Pastora

## 8. Orders Shipping to France or Belgium

In [22]:
sql("""
    SELECT OrderID, CustomerID, ShipCountry
    FROM Orders
    WHERE ShipCountry in ('France', 'Belgium')
""")

    OrderID CustomerID ShipCountry
0     10248      VINET      France
1     10251      VICTE      France
2     10252      SUPRD     Belgium
3     10265      BLONP      France
4     10274      VINET      France
..      ...        ...         ...
91    11035      SUPRD     Belgium
92    11038      SUPRD     Belgium
93    11043      SPECD      France
94    11051      LAMAI      France
95    11076      BONAP      France

[96 rows x 3 columns]

## 9. Order Shipping to Any Country in Latin America

- Since there's no list of Latin American countries, we're going to just use the list of Latin American countries that happen to be in the Orders table 
    - Brazil
    - Mexico
    - Argentina
    - Venezuela

In [23]:
sql("""
    SELECT OrderID, CustomerID, ShipCountry
    FROM Orders
    WHERE ShipCountry IN ('Brazil', 'Mexico', 'Argentina', 'Venezuela')
""")

     OrderID CustomerID ShipCountry
0      10250      HANAR      Brazil
1      10253      HANAR      Brazil
2      10256      WELLI      Brazil
3      10257      HILAA   Venezuela
4      10259      CENTC      Mexico
..       ...        ...         ...
168    11065      LILAS   Venezuela
169    11068      QUEEN      Brazil
170    11069      TORTU      Mexico
171    11071      LILAS   Venezuela
172    11073      PERIC      Mexico

[173 rows x 3 columns]

## 10. Employees, in Order of Age

In [28]:
sql("""
    SELECT FirstName, LastName, Title, BirthDate
    FROM Employees
    ORDER BY BirthDate 
""")

  FirstName   LastName                     Title  BirthDate
0  Margaret    Peacock      Sales Representative 1955-09-19
1     Nancy    Davolio      Sales Representative 1966-12-08
2    Andrew     Fuller     Vice President, Sales 1970-02-19
3    Steven   Buchanan             Sales Manager 1973-03-04
4     Laura   Callahan  Inside Sales Coordinator 1976-01-09
5    Robert       King      Sales Representative 1978-05-29
6   Michael     Suyama      Sales Representative 1981-07-02
7     Janet  Leverling      Sales Representative 1981-08-30
8      Anne  Dodsworth      Sales Representative 1984-01-27

## 11. Showing Only the Date with a DateTime Field

In [29]:
sql("""
    SELECT FirstName, LastName, Title, CAST(BirthDate as DATE) AS BirthDate 
    FROM Employees
    ORDER BY BirthDate
""")

  FirstName   LastName                     Title   BirthDate
0  Margaret    Peacock      Sales Representative  1955-09-19
1     Nancy    Davolio      Sales Representative  1966-12-08
2    Andrew     Fuller     Vice President, Sales  1970-02-19
3    Steven   Buchanan             Sales Manager  1973-03-04
4     Laura   Callahan  Inside Sales Coordinator  1976-01-09
5    Robert       King      Sales Representative  1978-05-29
6   Michael     Suyama      Sales Representative  1981-07-02
7     Janet  Leverling      Sales Representative  1981-08-30
8      Anne  Dodsworth      Sales Representative  1984-01-27

## 12. Employees Full Name

In [30]:
sql("""
    SELECT FirstName,
           LastName,
           (FirstName + ' ' + LastName) AS FullName
    FROM Employees
""")

  FirstName   LastName          FullName
0     Nancy    Davolio     Nancy Davolio
1    Andrew     Fuller     Andrew Fuller
2     Janet  Leverling   Janet Leverling
3  Margaret    Peacock  Margaret Peacock
4    Steven   Buchanan   Steven Buchanan
5   Michael     Suyama    Michael Suyama
6    Robert       King       Robert King
7     Laura   Callahan    Laura Callahan
8      Anne  Dodsworth    Anne Dodsworth

- Or, it could be done with CONCAT operator like below.

In [31]:
sql("""
    SELECT FirstName,
           LastName,
           CONCAT(FirstName,' ',LastName) AS FullName
    FROM Employees
""")

  FirstName   LastName          FullName
0     Nancy    Davolio     Nancy Davolio
1    Andrew     Fuller     Andrew Fuller
2     Janet  Leverling   Janet Leverling
3  Margaret    Peacock  Margaret Peacock
4    Steven   Buchanan   Steven Buchanan
5   Michael     Suyama    Michael Suyama
6    Robert       King       Robert King
7     Laura   Callahan    Laura Callahan
8      Anne  Dodsworth    Anne Dodsworth

## 13. OrderDetails Amount per Line Item

In [32]:
sql("""
    SELECT OrderID,
           ProductID,
           UnitPrice,
           Quantity,
           UnitPrice * Quantity AS TotalPrice
    FROM OrderDetails
""")

      OrderID  ProductID  UnitPrice  Quantity  TotalPrice
0       10248         11      14.00        12       168.0
1       10248         42       9.80        10        98.0
2       10248         72      34.80         5       174.0
3       10249         14      18.60         9       167.4
4       10249         51      42.40        40      1696.0
...       ...        ...        ...       ...         ...
2150    11077         64      33.25         2        66.5
2151    11077         66      17.00         1        17.0
2152    11077         73      15.00         2        30.0
2153    11077         75       7.75         4        31.0
2154    11077         77      13.00         2        26.0

[2155 rows x 5 columns]

## 14. How Many Customers?

In [33]:
sql("""
    SELECT COUNT(*) AS TotalCustomers
    FROM Customers
""")

   TotalCustomers
0              91

## 15. When was the First Order?

In [40]:
sql("""
    SELECT MIN(OrderDate) AS FirstOrder
    FROM Orders
""")

           FirstOrder
0 2014-07-04 08:00:00

## 16. Countries Where There are Customers

In [41]:
sql("""
    SELECT DISTINCT(Country) AS Country
    FROM Customers
""")

        Country
0     Argentina
1       Austria
2       Belgium
3        Brazil
4        Canada
5       Denmark
6       Finland
7        France
8       Germany
9       Ireland
10        Italy
11       Mexico
12       Norway
13       Poland
14     Portugal
15        Spain
16       Sweden
17  Switzerland
18           UK
19          USA
20    Venezuela

- It could be done using GROUP BY statement, as the hint says

In [42]:
sql("""
    SELECT Country 
    FROM Customers
    GROUP BY Country
""")

        Country
0     Argentina
1       Austria
2       Belgium
3        Brazil
4        Canada
5       Denmark
6       Finland
7        France
8       Germany
9       Ireland
10        Italy
11       Mexico
12       Norway
13       Poland
14     Portugal
15        Spain
16       Sweden
17  Switzerland
18           UK
19          USA
20    Venezuela

## 17. Contact Titles for Customers

In [43]:
sql("""
    SELECT ContactTitle,
           COUNT(*) AS TotalContactTitle
    FROM Customers
    GROUP BY ContactTitle
    ORDER BY COUNT(*) DESC
""")

                      ContactTitle  TotalContactTitle
0                            Owner                 17
1             Sales Representative                 17
2                Marketing Manager                 12
3                    Sales Manager                 11
4               Accounting Manager                 10
5                  Sales Associate                  7
6              Marketing Assistant                  6
7                      Sales Agent                  5
8            Assistant Sales Agent                  2
9              Order Administrator                  2
10  Assistant Sales Representative                  1
11       Owner/Marketing Assistant                  1

## 18. Products with Associated Supplier Names

In [45]:
sql("""
    SELECT ProductID, ProductName, CompanyName
    FROM Products p
    JOIN Suppliers s
    ON p.SupplierID = s.SupplierID
    ORDER BY ProductID
""")

    ProductID                      ProductName  \
0           1                             Chai
1           2                            Chang
2           3                    Aniseed Syrup
3           4     Chef Anton's Cajun Seasoning
4           5           Chef Anton's Gumbo Mix
..        ...                              ...
72         73                       Röd Kaviar
73         74                    Longlife Tofu
74         75             Rhönbräu Klosterbier
75         76                     Lakkalikööri
76         77  Original Frankfurter grüne Soße

                          CompanyName
0                      Exotic Liquids
1                      Exotic Liquids
2                      Exotic Liquids
3          New Orleans Cajun Delights
4          New Orleans Cajun Delights
..                                ...
72                  Svensk Sjöföda AB
73                      Tokyo Traders
74  Plutzer Lebensmittelgroßmärkte AG
75                          Karkki Oy
76  Plutzer Lebensmittelgroßmärkte AG

[77 rows x 3 columns]

## 19. Orders and the Shippers That was Used

In [49]:
sql("""
    SELECT OrderID,
           CAST(OrderDate AS DATE) AS OrderDate,
           CompanyName AS Shipper
    FROM Orders o
    JOIN Shippers s
    ON o.ShipVia = s.ShipperID
    WHERE OrderID < 10270
""")

    OrderID   OrderDate           Shipper
0     10248  2014-07-04  Federal Shipping
1     10249  2014-07-05    Speedy Express
2     10250  2014-07-08    United Package
3     10251  2014-07-08    Speedy Express
4     10252  2014-07-09    United Package
5     10253  2014-07-10    United Package
6     10254  2014-07-11    United Package
7     10255  2014-07-12  Federal Shipping
8     10256  2014-07-15    United Package
9     10257  2014-07-16  Federal Shipping
10    10258  2014-07-17    Speedy Express
11    10259  2014-07-18  Federal Shipping
12    10260  2014-07-19    Speedy Express
13    10261  2014-07-19    United Package
14    10262  2014-07-22  Federal Shipping
15    10263  2014-07-23  Federal Shipping
16    10264  2014-07-24  Federal Shipping
17    10265  2014-07-25    Speedy Express
18    10266  2014-07-26  Federal Shipping
19    10267  2014-07-29    Speedy Express
20    10268  2014-07-30  Federal Shipping
21    10269  2014-07-31    Speedy Express

# Intermediate Problems

## 20. Categories, and the Total Products in each Category

In [51]:
sql("""
    SELECT CategoryName, Count(*) AS TotalProducts
    FROM Products p
    JOIN Categories c
    ON p.CategoryID = c.CategoryID
    GROUP BY CategoryName
    ORDER BY Count(*) DESC
""")

     CategoryName  TotalProducts
0     Confections             13
1       Beverages             12
2      Condiments             12
3         Seafood             12
4  Dairy Products             10
5  Grains/Cereals              7
6    Meat/Poultry              6
7         Produce              5

## 21. Total Customers per Country/City

In [53]:
sql("""
    SELECT Country, City, COUNT(*) AS TotalCustomers
    FROM Customers
    GROUP BY Country, City
    ORDER BY TotalCustomers DESC
""")

        Country            City  TotalCustomers
0            UK          London               6
1        Mexico     México D.F.               5
2        Brazil       Sao Paulo               4
3        Brazil  Rio de Janeiro               3
4         Spain          Madrid               3
..          ...             ...             ...
64  Switzerland            Bern               1
65          USA           Boise               1
66       Sweden          Bräcke               1
67      Germany     Brandenburg               1
68      Belgium       Bruxelles               1

[69 rows x 3 columns]

## 22. Products That Need Reordering

In [55]:
sql("""
    SELECT ProductID, ProductName, UnitsInStock, ReorderLevel
    FROM Products
    WHERE UnitsInStock <= ReorderLevel
    ORDER BY ProductID
""")

    ProductID                ProductName  UnitsInStock  ReorderLevel
0           2                      Chang            17            25
1           3              Aniseed Syrup            13            25
2           5     Chef Anton's Gumbo Mix             0             0
3          11             Queso Cabrales            22            30
4          17               Alice Mutton             0             0
5          21        Sir Rodney's Scones             3             5
6          29    Thüringer Rostbratwurst             0             0
7          30      Nord-Ost Matjeshering            10            15
8          31          Gorgonzola Telino             0            20
9          32         Mascarpone Fabioli             9            25
10         37                 Gravad lax            11            25
11         43                Ipoh Coffee            17            25
12         45                Rogede sild             5            15
13         48                  Chocolade            15            25
14         49                   Maxilaku            10            15
15         53              Perth Pasties             0             0
16         56     Gnocchi di nonna Alice            21            30
17         64  Wimmers gute Semmelknödel            22            30
18         66  Louisiana Hot Spiced Okra             4            20
19         68        Scottish Longbreads             6            15
20         70              Outback Lager            15            30
21         74              Longlife Tofu             4             5

## 23. Products That Need Reordering, Continued

In [60]:
sql("""
    SELECT ProductID AS 'Product ID',
           ProductName AS 'Product Name',
           UnitsInStock AS 'Units In Stock',
           ReorderLevel AS 'Reorder Level',
           Discontinued
    FROM Products
    WHERE (UnitsInStock + UnitsOnOrder) <= ReorderLevel and 
          Discontinued = 0
    ORDER BY ProductID
""")

   Product ID           Product Name  Units In Stock  Reorder Level  \
0          30  Nord-Ost Matjeshering              10             15
1          70          Outback Lager              15             30

   Discontinued
0         False
1         False

## 24. Customer List by Region (RECAP!)

In [75]:
sql("""
    SELECT CustomerID,
           CompanyName,
           Region
    FROM Customers
    ORDER BY (CASE WHEN Region IS NOT null 
              THEN Region ELSE 'ZZ' END),
              CustomerID
""")

   CustomerID                    CompanyName    Region
0       OLDWO         Old World Delicatessen        AK
1       BOTTM          Bottom-Dollar Markets        BC
2       LAUGB  Laughing Bacchus Wine Cellars        BC
3       LETSS              Let's Stop N Shop        CA
4       HUNGO   Hungry Owl All-Night Grocers  Co. Cork
..        ...                            ...       ...
86      VINET      Vins et alcools Chevalier      None
87      WANDK              Die Wandernde Kuh      None
88      WARTH                 Wartian Herkku      None
89      WILMK                    Wilman Kala      None
90      WOLZA                 Wolski  Zajazd      None

[91 rows x 3 columns]

### Note
- CASE WHEN {condition} THEN {value1} ELSE {value2} END

## 25. High Freight Charges

In [80]:
sql("""
    SELECT TOP 3 ShipCountry,
           AVG(Freight) AS AverageFreight
    FROM Orders
    GROUP BY ShipCountry
    ORDER BY AverageFreight DESC
""")

  ShipCountry  AverageFreight
0     Austria        184.7875
1     Ireland        145.0126
2         USA        112.8794

In [81]:
sql("""
    SELECT ShipCountry,
           AVG(Freight) AS AverageFreight
    FROM Orders
    GROUP BY ShipCountry
    ORDER BY AverageFreight DESC
    OFFSET 0 ROWS FETCH NEXT 3 ROWS ONLY
""")

  ShipCountry  AverageFreight
0     Austria        184.7875
1     Ireland        145.0126
2         USA        112.8794

### Note
- No LIMIT Clause in MSSQL
- Use SELECT TOP or OFFSET {n} ROWS FETCH NEXT {n} ROWS ONLY

## 26. High Freight Charges - 2015

In [86]:
sql("""
    SELECT TOP 3 ShipCountry,
           AVG(Freight) AS AverageFreight
    FROM Orders
    WHERE YEAR(OrderDate) = 2015
    GROUP BY ShipCountry
    ORDER BY AverageFreight DESC
""")

   ShipCountry  AverageFreight
0      Austria        178.3642
1  Switzerland        117.1775
2       France        113.9910

### Note
- No EXTRACT() function in SQL Server
- Use YEAR() or DATEPART() instead.

## 27. High Frieght Charges with Between

In [87]:
sql("""
    SELECT TOP 3 
           ShipCountry,
           AVG(Freight) AS AverageFreight
    FROM ORDERS
    WHERE OrderDate BETWEEN '20150101' AND '20160101'
    GROUP BY ShipCountry
    ORDER BY AverageFreight DESC
""")

   ShipCountry  AverageFreight
0      Austria        178.3642
1  Switzerland        117.1775
2       France        113.9910

### Note
- Date 20151231 doesn't really include records from 2015-12-31. 
- OrderDate is DateTime type.
- Date 20151231 sets upper limit date time to 2015-12-31 00:00:00, which excludes records with OrderDate in 20151231
- If OrderDate were type of Date, 20151231 would have set upper limit as intended

## 28. High Freight Charges - Last Year (RECAP!)

In [89]:
sql("""
    SELECT TOP 3
           ShipCountry,
           AVG(Freight) AS AverageFreight
    FROM Orders
    WHERE
        OrderDate >= DATEADD(YEAR, -1, (SELECT MAX(Orderdate) FROM ORDERS))
    GROUP BY ShipCountry
    ORDER BY AverageFreight DESC
""")

  ShipCountry  AverageFreight
0     Ireland        200.2100
1     Austria        186.4596
2         USA        119.3032

### Note
- DATEADD(DATEPART, number, DateTime)
- This function adds a specified number value (as a signed integer) to a specified datepart of an input date value, and then returns that modified value.

In [90]:
sql("""
    SELECT DATEADD(YEAR, -1, OrderDate) FROM Orders
""")

0   2013-07-04 08:00:00
1   2013-07-05 04:00:00
2   2013-07-08 15:00:00
3   2013-07-08 14:00:00
4   2013-07-09 01:00:00
..                  ...
825 2015-05-05 12:00:00
826 2015-05-06 01:00:00
827 2015-05-06 18:00:00
828 2015-05-06 00:00:00
829 2015-05-06 17:00:00

[830 rows x 1 columns]

## 29. Employee/Order Detail Report

In [95]:
sql("""
    SELECT
        e.EmployeeID,
        LastName,
        od.OrderID,
        p.ProductName,
        Quantity
    FROM OrderDetails od
    JOIN Orders o
    ON od.OrderID = o.OrderID
    JOIN Products p
    ON od.ProductID = p.ProductID
    JOIN Employees e
    ON o.EmployeeID = e.EmployeeID
    ORDER BY od.OrderID, p.ProductID
""")

      EmployeeID  LastName  OrderID                      ProductName  Quantity
0              5  Buchanan    10248                   Queso Cabrales        12
1              5  Buchanan    10248    Singaporean Hokkien Fried Mee        10
2              5  Buchanan    10248           Mozzarella di Giovanni         5
3              6    Suyama    10249                             Tofu         9
4              6    Suyama    10249            Manjimup Dried Apples        40
...          ...       ...      ...                              ...       ...
2150           1   Davolio    11077        Wimmers gute Semmelknödel         2
2151           1   Davolio    11077        Louisiana Hot Spiced Okra         1
2152           1   Davolio    11077                       Röd Kaviar         2
2153           1   Davolio    11077             Rhönbräu Klosterbier         4
2154           1   Davolio    11077  Original Frankfurter grüne Soße         2

[2155 rows x 5 columns]

## 30. Customers with No Orders

In [96]:
sql("""
    SELECT c.CustomerID as Customers_CustomerID,
           NULL as Orders_CustomerID
    FROM Customers c
    WHERE c.CustomerID NOT IN (
        SELECT DISTINCT CustomerID FROM Orders
    )
""")

  Customers_CustomerID Orders_CustomerID
0                FISSA              None
1                PARIS              None

- Or, it could be done using left join.

In [100]:
sql("""
    SELECT c.CustomerID AS Customers_CustomerID,
           o.CustomerID AS Orders_CustomerID
    FROM Customers c
    LEFT JOIN Orders o
    ON c.CustomerID = o.CustomerID
    WHERE o.CustomerID IS null
""")

  Customers_CustomerID Orders_CustomerID
0                PARIS              None
1                FISSA              None

## 31. Customers with No Orders for EmployeeID 4

In [101]:
sql("""
    SELECT c.CustomerID as CustomerID,
           o.CustomerID as CustomerID
    FROM Customers c
    LEFT JOIN (
        SELECT CustomerID FROM Orders
        WHERE EmployeeID = 4
    ) o
    ON o.CustomerID = c.CustomerID
    WHERE o.CustomerID IS null
""")

   CustomerID CustomerID
0       CONSH       None
1       DUMON       None
2       FISSA       None
3       FRANR       None
4       GROSR       None
5       LAUGB       None
6       LAZYK       None
7       NORTS       None
8       PARIS       None
9       PERIC       None
10      PRINI       None
11      SANTG       None
12      SEVES       None
13      SPECD       None
14      THEBI       None
15      VINET       None

### Note
- With outer joins, the filters on the were clause are applied _after_ the join.

# Advanced Problems

## 32. High-Value Customers

In [10]:
sql("""
    SELECT c.CustomerID,
           c.CompanyName,
           o.OrderID,
           SUM(od.UnitPrice * od.Quantity) AS TotalOrderAmount
    FROM Orders o
    JOIN OrderDetails od
    ON o.OrderID = od.OrderID
    JOIN Customers c
    ON o.CustomerID = c.CustomerID
    WHERE YEAR(o.OrderDate) = 2016
    GROUP BY c.CustomerID, c.CompanyName, o.OrderID
    HAVING SUM(od.UnitPrice * od.Quantity) >= 10000
    ORDER BY SUM(od.UnitPrice * od.Quantity) DESC
""")

  CustomerID                   CompanyName  OrderID  TotalOrderAmount
0      QUICK                    QUICK-Stop    10865          17250.00
1      SAVEA            Save-a-lot Markets    11030          16321.90
2      HANAR                 Hanari Carnes    10981          15810.00
3      KOENE               Königlich Essen    10817          11490.70
4      RATTC    Rattlesnake Canyon Grocery    10889          11380.00
5      HUNGO  Hungry Owl All-Night Grocers    10897          10835.24

### Note
- Aggregate functions can only be used to filter(with some exceptions) in the HAVING clause, not the Where clause.

## 33. High-Value Customers - Total Orders

In [11]:
sql("""
    SELECT c.CustomerID,
           c.CompanyName,
           SUM(od.UnitPrice * od.Quantity) AS TotalOrderAmount
    FROM Orders o 
    JOIN OrderDetails od
    ON o.OrderID = od.OrderID
    JOIN Customers c
    ON o.CustomerID = c.CustomerID
    WHERE YEAR(o.OrderDate) = 2016
    GROUP BY c.CustomerID, c.CompanyName
    HAVING SUM(od.UnitPrice * od.Quantity) >= 15000
    ORDER BY SUM(od.UnitPrice * od.Quantity) DESC
""")

  CustomerID                   CompanyName  TotalOrderAmount
0      SAVEA            Save-a-lot Markets          42806.25
1      ERNSH                  Ernst Handel          42598.90
2      QUICK                    QUICK-Stop          40526.99
3      HANAR                 Hanari Carnes          24238.05
4      HUNGO  Hungry Owl All-Night Grocers          22796.34
5      RATTC    Rattlesnake Canyon Grocery          21725.60
6      KOENE               Königlich Essen          20204.95
7      FOLKO                Folk och fä HB          15973.85
8      WHITC          White Clover Markets          15278.90

## 34. High-Value Customers - with Discount

- Let's first take a look how data are stored in Discount column.

In [6]:
sql("""
    SELECT TOP 1 * FROM OrderDetails WHERE Discount != 0
""")

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10250         51       42.4        35      0.15

- It seems Discount column represents 'rate of discount'

In [8]:
sql("""
    SELECT c.CustomerID AS 'Customer ID',
           c.CompanyName AS 'Company Name',
           SUM(od.UnitPrice * od.Quantity) AS 'Totals Without Discount',
           SUM(od.UnitPrice * od.Quantity * (1 - od.Discount)) AS 'Totals With Discount'
    FROM Orders o 
    JOIN OrderDetails od
    ON o.OrderID = od.OrderID
    JOIN Customers c
    ON o.CustomerID = c.CustomerID
    WHERE YEAR(o.OrderDate) = 2016
    GROUP BY c.CustomerID, c.CompanyName
    HAVING SUM(od.UnitPrice * od.Quantity) >= 15000
    ORDER BY SUM(od.UnitPrice * od.Quantity * (1 - od.Discount)) DESC
""")

  Customer ID                  Company Name  Totals Without Discount  \
0       ERNSH                  Ernst Handel                 42598.90
1       QUICK                    QUICK-Stop                 40526.99
2       SAVEA            Save-a-lot Markets                 42806.25
3       HANAR                 Hanari Carnes                 24238.05
4       RATTC    Rattlesnake Canyon Grocery                 21725.60
5       HUNGO  Hungry Owl All-Night Grocers                 22796.34
6       KOENE               Königlich Essen                 20204.95
7       WHITC          White Clover Markets                 15278.90
8       FOLKO                Folk och fä HB                 15973.85

   Totals With Discount
0          41210.650024
1          37217.315002
2          36310.109779
3          23821.199989
4          21238.270441
5          20402.119934
6          19582.773987
7          15278.899986
8          13644.067497

## 35. Month-end Orders

In [10]:
sql("""
    SELECT EmployeeID, 
           OrderID,
           OrderDate
    FROM Orders
    WHERE MONTH(OrderDate) != MONTH(DATEADD(DAY, 1, OrderDate))
    ORDER BY EmployeeID, OrderID
""")

    EmployeeID  OrderID           OrderDate
0            1    10461 2015-02-28 00:00:00
1            1    10616 2015-07-31 00:00:00
2            2    10583 2015-06-30 00:00:00
3            2    10686 2015-09-30 00:00:00
4            2    10989 2016-03-31 00:00:00
5            2    11060 2016-04-30 00:00:00
6            3    10432 2015-01-31 00:00:00
7            3    10806 2015-12-31 11:00:00
8            3    10988 2016-03-31 00:00:00
9            3    11063 2016-04-30 00:00:00
10           4    10343 2014-10-31 00:00:00
11           4    10522 2015-04-30 00:00:00
12           4    10584 2015-06-30 00:00:00
13           4    10617 2015-07-31 00:00:00
14           4    10725 2015-10-31 00:00:00
15           4    10807 2015-12-31 11:00:00
16           4    11061 2016-04-30 00:00:00
17           4    11062 2016-04-30 00:00:00
18           5    10269 2014-07-31 00:00:00
19           6    10317 2014-09-30 00:00:00
20           7    10490 2015-03-31 00:00:00
21           8    10399 2014-12-31 00:00:00
22           8    10460 2015-02-28 00:00:00
23           8    10491 2015-03-31 00:00:00
24           8    10987 2016-03-31 00:00:00
25           9    10687 2015-09-30 00:00:00

- In SQL Server, I can use EOMONTH() as follows

In [12]:
sql("""
    SELECT EmployeeID, 
           OrderID,
           OrderDate
    FROM Orders
    WHERE EOMONTH(OrderDate) = OrderDate
    ORDER BY EmployeeID, OrderID
""")

    EmployeeID  OrderID  OrderDate
0            1    10461 2015-02-28
1            1    10616 2015-07-31
2            2    10583 2015-06-30
3            2    10686 2015-09-30
4            2    10989 2016-03-31
5            2    11060 2016-04-30
6            3    10432 2015-01-31
7            3    10988 2016-03-31
8            3    11063 2016-04-30
9            4    10343 2014-10-31
10           4    10522 2015-04-30
11           4    10584 2015-06-30
12           4    10617 2015-07-31
13           4    10725 2015-10-31
14           4    11061 2016-04-30
15           4    11062 2016-04-30
16           5    10269 2014-07-31
17           6    10317 2014-09-30
18           7    10490 2015-03-31
19           8    10399 2014-12-31
20           8    10460 2015-02-28
21           8    10491 2015-03-31
22           8    10987 2016-03-31
23           9    10687 2015-09-30

## 36. Orders with Many Line Items

- Let's first explore OrderDetails

In [13]:
sql("""
    SELECT * FROM OrderDetails
    WHERE OrderID = 10324
""")

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10324         16       13.9        21      0.15
1    10324         35       14.4        70      0.15
2    10324         46        9.6        30      0.00
3    10324         59       44.0        40      0.15
4    10324         63       35.1        80      0.15

In [16]:
sql("""
    SELECT TOP 10 OrderID, COUNT(*) AS TotalOrderDetails FROM OrderDetails
    GROUP BY OrderID
    ORDER BY COUNT(*) DESC
""")

   OrderID  TotalOrderDetails
0    11077                 25
1    10657                  6
2    10847                  6
3    10979                  6
4    10273                  5
5    10294                  5
6    10309                  5
7    10324                  5
8    10325                  5
9    10337                  5

## 37. Orders - Random Assortment

In [36]:
sql("""
    SELECT TOP (SELECT CAST(CEILING(COUNT(*) * 0.02) AS INT) FROM Orders)
           OrderID
    FROM Orders
    ORDER BY NEWID()
""")

    OrderID
0     10734
1     10911
2     10374
3     10776
4     10833
5     10449
6     10534
7     10272
8     10375
9     10447
10    10936
11    11065
12    10264
13    10395
14    10523
15    10545
16    10832

### Note
- https://stackoverflow.com/questions/580639/how-to-randomly-select-rows-in-sql Refer to this link to see different random function names for each SQL implementaion
- Also, SQL Server syntax supports TOP n PERCENT.

In [37]:
sql("""
    SELECT TOP 2 PERCENT
           OrderID
    FROM Orders
    ORDER BY NEWID()
""")

    OrderID
0     10451
1     11034
2     10946
3     10821
4     10937
5     10572
6     10682
7     10977
8     10270
9     10615
10    10290
11    10554
12    10539
13    10929
14    11022
15    10903
16    10435

## 38. Orders - Accidental Double-Entry (RECAP!)

In [56]:
sql("""
    SELECT DISTINCT o.OrderID FROM OrderDetails o
    JOIN OrderDetails oo
    ON o.OrderID = oo.OrderID and o.Quantity = oo.Quantity and o.ProductID != oo.ProductID
    WHERE o.Quantity >= 60
    ORDER BY o.OrderID
""")

   OrderID
0    10263
1    10658
2    10990
3    11030

### 38. Solution Code

In [53]:
sql("""
    SELECT OrderID FROM OrderDetails
    WHERE Quantity >= 60
    GROUP BY OrderID, Quantity
    HAVING COUNT(*) > 1
    ORDER BY OrderID
""")

   OrderID
0    10263
1    10263
2    10658
3    10990
4    11030

## 39. Orders - Accidental Double-Entry Details

In [58]:
sql("""
    SELECT o.OrderID, o.ProductID, o.UnitPrice, o.Quantity, o.Discount FROM OrderDetails o
    JOIN OrderDetails oo
    ON o.OrderID = oo.OrderID and o.Quantity = oo.Quantity and o.ProductID != oo.ProductID
    WHERE o.Quantity >= 60
    ORDER BY o.OrderID, o.Quantity
""")

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10263         30       20.7        60      0.25
1    10263         16       13.9        60      0.25
2    10263         24        3.6        65      0.00
3    10263         74        8.0        65      0.25
4    10658         77       13.0        70      0.05
5    10658         40       18.4        70      0.05
6    10990         21       10.0        65      0.00
7    10990         55       24.0        65      0.15
8    11030          2       19.0       100      0.25
9    11030         59       55.0       100      0.25

- The answer shows all line items by OrderIDs that include accidental double entry. 
- On the contrary, my solution shows only the line items that might be a accidental duplicate entry.
- I do think my solution is better, but the solution introduces a concept that is new to me (CTE, Common Table Expression). 
    - CTE -> Named subquery

In [62]:
# Solution code with CTE
sql("""
;WITH PotentialProblemOrders AS (
    SELECT OrderID FROM OrderDetails
    WHERE Quantity >= 60
    GROUP BY OrderID, Quantity
    HAVING COUNT(*) > 1
)
SELECT * FROM OrderDetails
WHERE OrderID IN (SELECT OrderID FROM PotentialProblemOrders)
""")

    OrderID  ProductID  UnitPrice  Quantity  Discount
0     10263         16      13.90        60      0.25
1     10263         24       3.60        65      0.00
2     10263         30      20.70        60      0.25
3     10263         74       8.00        65      0.25
4     10658         21      10.00        60      0.00
5     10658         40      18.40        70      0.05
6     10658         60      34.00        55      0.05
7     10658         77      13.00        70      0.05
8     10990         21      10.00        65      0.00
9     10990         34      14.00        60      0.15
10    10990         55      24.00        65      0.15
11    10990         61      28.50        66      0.15
12    11030          2      19.00       100      0.25
13    11030          5      21.35        70      0.00
14    11030         29     123.79        60      0.25
15    11030         59      55.00       100      0.25

## 40. Orders - Accidental Double-Entry Details, Derived Table

- Same question as above, using derived table instead of CTE.
- Derived table -> A derived table is a subquery nested within a FROM clause

In [64]:
sql("""
    SELECT * FROM OrderDetails
    JOIN (
        SELECT DISTINCT OrderID FROM OrderDetails
        WHERE Quantity >= 60
        GROUP BY OrderID, Quantity
        HAVING COUNT(*) > 1
    ) PotentialProblemOrders
    ON OrderDetails.OrderID = PotentialProblemOrders.OrderID
    ORDER BY OrderDetails.OrderID, ProductID
""")

    OrderID  ProductID  UnitPrice  Quantity  Discount  OrderID
0     10263         16      13.90        60      0.25    10263
1     10263         24       3.60        65      0.00    10263
2     10263         30      20.70        60      0.25    10263
3     10263         74       8.00        65      0.25    10263
4     10658         21      10.00        60      0.00    10658
5     10658         40      18.40        70      0.05    10658
6     10658         60      34.00        55      0.05    10658
7     10658         77      13.00        70      0.05    10658
8     10990         21      10.00        65      0.00    10990
9     10990         34      14.00        60      0.15    10990
10    10990         55      24.00        65      0.15    10990
11    10990         61      28.50        66      0.15    10990
12    11030          2      19.00       100      0.25    11030
13    11030          5      21.35        70      0.00    11030
14    11030         29     123.79        60      0.25    11030
15    11030         59      55.00       100      0.25    11030

## 41. Late Orders

In [70]:
sql("""
    SELECT OrderID,
           CAST(OrderDate AS DATE) AS OrderDate,
           CAST(RequiredDate AS DATE) AS RequiredDate,
           CAST(ShippedDate AS DATE) AS ShippedDate
    FROM Orders
    WHERE CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE)
    ORDER BY OrderID
""")

    OrderID   OrderDate RequiredDate ShippedDate
0     10264  2014-07-24   2014-08-21  2014-08-23
1     10271  2014-08-01   2014-08-29  2014-08-30
2     10280  2014-08-14   2014-09-11  2014-09-12
3     10302  2014-09-10   2014-10-08  2014-10-09
4     10309  2014-09-19   2014-10-17  2014-10-23
5     10380  2014-12-12   2015-01-09  2015-01-16
6     10423  2015-01-23   2015-02-06  2015-02-24
7     10427  2015-01-27   2015-02-24  2015-03-03
8     10433  2015-02-03   2015-03-03  2015-03-04
9     10451  2015-02-19   2015-03-05  2015-03-12
10    10483  2015-03-24   2015-04-21  2015-04-25
11    10515  2015-04-23   2015-05-07  2015-05-23
12    10523  2015-05-01   2015-05-29  2015-05-30
13    10545  2015-05-22   2015-06-19  2015-06-26
14    10578  2015-06-24   2015-07-22  2015-07-25
15    10593  2015-07-09   2015-08-06  2015-08-13
16    10596  2015-07-11   2015-08-08  2015-08-12
17    10660  2015-09-08   2015-10-06  2015-10-15
18    10663  2015-09-10   2015-09-24  2015-10-03
19    10687  2015-09-30   2015-10-28  2015-10-30
20    10705  2015-10-15   2015-11-12  2015-11-18
21    10709  2015-10-17   2015-11-14  2015-11-20
22    10726  2015-11-03   2015-11-17  2015-12-05
23    10727  2015-11-03   2015-12-01  2015-12-05
24    10749  2015-11-20   2015-12-18  2015-12-19
25    10777  2015-12-15   2015-12-29  2016-01-21
26    10779  2015-12-16   2016-01-13  2016-01-14
27    10807  2015-12-31   2016-01-28  2016-01-30
28    10816  2016-01-06   2016-02-03  2016-02-04
29    10827  2016-01-12   2016-01-26  2016-02-06
30    10828  2016-01-13   2016-01-27  2016-02-04
31    10847  2016-01-22   2016-02-05  2016-02-10
32    10924  2016-03-04   2016-04-01  2016-04-08
33    10927  2016-03-05   2016-04-02  2016-04-08
34    10960  2016-03-19   2016-04-02  2016-04-08
35    10970  2016-03-24   2016-04-07  2016-04-24

## 42. Late Orders - Which Employee?

- Let's first practice how to use CTE, then I'll solve the problem in much easier way.

In [87]:
sql("""
WITH LateOrders AS (
    SELECT OrderID
    FROM Orders
    WHERE CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE)
)

SELECT o.EmployeeID, LastName, COUNT(*) AS TotalLateOrders FROM Orders o
JOIN Employees e
ON e.EmployeeID = o.EmployeeID
WHERE o.OrderID IN (SELECT OrderID FROM LateOrders)
GROUP BY o.EmployeeID, LastName
ORDER BY COUNT(*) DESC
""")

   EmployeeID   LastName  TotalLateOrders
0           4    Peacock               10
1           3  Leverling                5
2           7       King                4
3           8   Callahan                4
4           9  Dodsworth                4
5           2     Fuller                4
6           6     Suyama                3
7           1    Davolio                2

In [79]:
sql("""
    SELECT o.EmployeeID, LastName, COUNT(*) AS TotalLateOrders FROM Orders o
    JOIN Employees e
    ON e.EmployeeID = o.EmployeeID
    WHERE CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE)
    GROUP BY o.EmployeeID, LastName
    ORDER BY COUNT(*) DESC
""")

   EmployeeID   LastName  TotalLateOrders
0           4    Peacock               10
1           3  Leverling                5
2           7       King                4
3           8   Callahan                4
4           9  Dodsworth                4
5           2     Fuller                4
6           6     Suyama                3
7           1    Davolio                2

## 43. Late Orders vs. Total Orders

In [98]:
sql("""
WITH LateOrderCounts AS (
    SELECT o.EmployeeID, LastName, COUNT(*) AS LateOrders FROM Orders o
    JOIN Employees e
    ON e.EmployeeID = o.EmployeeID
    WHERE CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE)
    GROUP BY o.EmployeeID, LastName 
),
TotalOrders AS (
    SELECT EmployeeID, COUNT(*) AS TotalOrders
    FROM Orders 
    GROUP BY EmployeeID
)

SELECT DISTINCT o.EmployeeID, lo.LastName, total.TotalOrders, lo.LateOrders
FROM Orders o
JOIN LateOrderCounts lo
ON o.EmployeeID = lo.EmployeeID
JOIN TotalOrders total
ON o.EmployeeID = total.EmployeeID
ORDER BY o.EmployeeID
""")

   EmployeeID   LastName  TotalOrders  LateOrders
0           1    Davolio          123           2
1           2     Fuller           96           4
2           3  Leverling          127           5
3           4    Peacock          156          10
4           6     Suyama           67           3
5           7       King           72           4
6           8   Callahan          104           4
7           9  Dodsworth           43           4

### Note
- Using multiple CTEs, separate each declration with comma as below.
- WITH    cte1 AS
        (
        SELECT  1 AS id
        ),
        cte2 AS
        (
        SELECT  2 AS id
        )

## 44. Late Orders vs. Total Orders - Missing Employee

In [99]:
sql("""
WITH LateOrderCounts AS (
    SELECT o.EmployeeID, LastName, COUNT(*) AS LateOrders FROM Orders o
    JOIN Employees e
    ON e.EmployeeID = o.EmployeeID
    WHERE CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE)
    GROUP BY o.EmployeeID, LastName 
),
TotalOrders AS (
    SELECT EmployeeID, COUNT(*) AS TotalOrders
    FROM Orders 
    GROUP BY EmployeeID
)

SELECT DISTINCT o.EmployeeID, lo.LastName, total.TotalOrders, lo.LateOrders
FROM Orders o
LEFT JOIN LateOrderCounts lo
ON o.EmployeeID = lo.EmployeeID
JOIN TotalOrders total
ON o.EmployeeID = total.EmployeeID
ORDER BY o.EmployeeID
""")

   EmployeeID   LastName  TotalOrders  LateOrders
0           1    Davolio          123         2.0
1           2     Fuller           96         4.0
2           3  Leverling          127         5.0
3           4    Peacock          156        10.0
4           5       None           42         NaN
5           6     Suyama           67         3.0
6           7       King           72         4.0
7           8   Callahan          104         4.0
8           9  Dodsworth           43         4.0

## 45. Late Orders vs. Total Orders - Fix Null

- Cause of the Null value was the use of LEFT JOIN clause.
- Let's write a same query without using LEFT JOIN.

In [116]:
sql("""
    SELECT o.EmployeeID,
           LastName,
           COUNT(*) AS AllOrders,
           SUM(CASE WHEN CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE) THEN 1 ELSE 0 END) AS LateOrders
    FROM Orders o
    JOIN Employees e
    ON o.EmployeeID = e.EmployeeID
    GROUP BY o.EmployeeID, LastName
    ORDER BY o.EmployeeID
""")

   EmployeeID   LastName  AllOrders  LateOrders
0           1    Davolio        123           2
1           2     Fuller         96           4
2           3  Leverling        127           5
3           4    Peacock        156          10
4           5   Buchanan         42           0
5           6     Suyama         67           3
6           7       King         72           4
7           8   Callahan        104           4
8           9  Dodsworth         43           4

## 46. Late Orders vs. Total Orders - Percentage

In [129]:
sql("""
    SELECT o.EmployeeID,
           LastName,
           COUNT(*) AS AllOrders,
           SUM(CASE WHEN CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE) THEN 1 ELSE 0 END) AS LateOrders,
           SUM(CASE WHEN CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE) THEN 1.0 ELSE 0.0 END) / COUNT(*) AS 'Percent Late Orders'
    FROM Orders o
    JOIN Employees e
    ON o.EmployeeID = e.EmployeeID
    GROUP BY o.EmployeeID, LastName
    ORDER BY o.EmployeeID
""")

   EmployeeID   LastName  AllOrders  LateOrders  Percent Late Orders
0           1    Davolio        123           2             0.016260
1           2     Fuller         96           4             0.041666
2           3  Leverling        127           5             0.039370
3           4    Peacock        156          10             0.064102
4           5   Buchanan         42           0             0.000000
5           6     Suyama         67           3             0.044776
6           7       King         72           4             0.055555
7           8   Callahan        104           4             0.038461
8           9  Dodsworth         43           4             0.093023

## 47. Late Orders vs. Total Orders - Fix Decimal

In [128]:
sql("""
    SELECT o.EmployeeID,
           LastName,
           COUNT(*) AS AllOrders,
           SUM(CASE WHEN CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE) THEN 1 ELSE 0 END) AS LateOrders,
           ROUND(SUM(CASE WHEN CAST(ShippedDate AS DATE) > CAST(RequiredDate AS DATE) THEN 1.0 ELSE 0.0 END) / COUNT(*),2) AS 'Percent Late Orders'
    FROM Orders o
    JOIN Employees e
    ON o.EmployeeID = e.EmployeeID
    GROUP BY o.EmployeeID, LastName
    ORDER BY o.EmployeeID
""")

   EmployeeID   LastName  AllOrders  LateOrders  Percent Late Orders
0           1    Davolio        123           2                 0.02
1           2     Fuller         96           4                 0.04
2           3  Leverling        127           5                 0.04
3           4    Peacock        156          10                 0.06
4           5   Buchanan         42           0                 0.00
5           6     Suyama         67           3                 0.04
6           7       King         72           4                 0.06
7           8   Callahan        104           4                 0.04
8           9  Dodsworth         43           4                 0.09

## 48. Customer Grouping

In [134]:
sql("""
WITH TotalAmount AS (
    SELECT o.CustomerID,
           SUM(od.UnitPrice * od.Quantity * (1-od.Discount)) AS Total
    FROM Orders o
    JOIN OrderDetails od
    ON o.OrderId = od.OrderID
    WHERE YEAR(o.OrderDate) = 2016
    GROUP BY o.CustomerID
)

SELECT t.CustomerID,
       c.CompanyName AS 'Company Name',
       t.Total AS 'Total Order Amount',
       (CASE WHEN t.Total BETWEEN 0 AND 1000 THEN 'Low'
             WHEN t.Total BETWEEN 1001 AND 5000 THEN 'Medium'
             WHEN t.Total BETWEEN 5001 AND 10000 THEN 'High'
             ELSE 'Very High'
        END) AS 'Customer Group'
FROM TotalAmount t
JOIN Customers c
ON t.CustomerID = c.CustomerID
ORDER BY t.CustomerID
""")

   CustomerID                        Company Name  Total Order Amount  \
0       ALFKI                 Alfreds Futterkiste         2250.499998
1       ANATR  Ana Trujillo Emparedados y helados          514.400002
2       ANTON             Antonio Moreno Taquería          660.000000
3       AROUT                     Around the Horn         5604.750000
4       BERGS                  Berglunds snabbköp         6754.162476
..        ...                                 ...                 ...
76      WARTH                      Wartian Herkku          270.000000
77      WELLI              Wellington Importadora         1135.250000
78      WHITC                White Clover Markets        15278.899986
79      WILMK                         Wilman Kala         1987.000008
80      WOLZA                      Wolski  Zajazd         1865.099976

   Customer Group
0          Medium
1             Low
2             Low
3            High
4            High
..            ...
76            Low
77         Medium
78      Very High
79         Medium
80         Medium

[81 rows x 4 columns]

## 49. Customer Grouping - Fix Null

In [140]:
sql("""
WITH TotalAmount AS (
    SELECT o.CustomerID,
           SUM(od.UnitPrice * od.Quantity * (1-od.Discount)) AS Total
    FROM Orders o
    JOIN OrderDetails od
    ON o.OrderId = od.OrderID
    WHERE YEAR(o.OrderDate) = 2016
    GROUP BY o.CustomerID
),
CustomerGroupTable AS(
SELECT t.CustomerID,
       c.CompanyName AS 'Company Name',
       t.Total AS 'Total Order Amount',
       (CASE WHEN t.Total BETWEEN 0 AND 1000 THEN 'Low'
             WHEN t.Total BETWEEN 1001 AND 5000 THEN 'Medium'
             WHEN t.Total BETWEEN 5001 AND 10000 THEN 'High'
             ELSE 'Very High'
        END) AS CustomerGroup
FROM TotalAmount t
JOIN Customers c
ON t.CustomerID = c.CustomerID)

SELECT DISTINCT CustomerGroup FROM CustomerGroupTable
""")

  CustomerGroup
0          High
1           Low
2        Medium
3     Very High

- It looks like there's no null value in the CustomerGroup column.

## 50. Customer Grouping with Percentage

In [153]:
sql("""
WITH TotalAmount AS (
    SELECT o.CustomerID,
           SUM(od.UnitPrice * od.Quantity * (1-od.Discount)) AS Total
    FROM Orders o
    JOIN OrderDetails od
    ON o.OrderId = od.OrderID
    WHERE YEAR(o.OrderDate) = 2016
    GROUP BY o.CustomerID
),
CustomerGroupTable AS(
SELECT t.CustomerID,
       c.CompanyName AS 'Company Name',
       t.Total AS 'Total Order Amount',
       (CASE WHEN t.Total >= 0 AND t.Total < 1000 THEN 'Low'
             WHEN t.Total >= 1000 AND t.Total < 5000 THEN 'Medium'
             WHEN t.Total >= 5000 AND t.Total < 10000 THEN 'High'
             ELSE 'Very High'
        END) AS CustomerGroup
FROM TotalAmount t
JOIN Customers c
ON t.CustomerID = c.CustomerID)

SELECT CustomerGroup,
       COUNT(*) AS TotalInGroup,
       CAST(COUNT(*) AS DECIMAL) / (SELECT COUNT(*) FROM CustomerGroupTable) AS PercentageInGroup
FROM CustomerGroupTable
GROUP BY CustomerGroup
ORDER BY COUNT(*) DESC
""")

  CustomerGroup  TotalInGroup  PercentageInGroup
0        Medium            37           0.456790
1           Low            20           0.246914
2          High            13           0.160494
3     Very High            11           0.135802

## 51. Customer Grouping - Flexible

- Now, let's do the same thing (customer grouping) with CustomerGroupThresholds table, which defines customer groups and corresponding group ranges

In [6]:
sql("""SELECT * FROM CustomerGroupThresholds""")

  CustomerGroupName  RangeBottom      RangeTop
0               Low          0.0  9.999999e+02
1            Medium       1000.0  5.000000e+03
2              High       5000.0  1.000000e+04
3         Very High      10000.0  9.223372e+14

In [10]:
sql("""
WITH TotalOrderAmounts AS (
    SELECT o.CustomerID,
       c.CompanyName,
       SUM(od.UnitPrice * od.Quantity * (1 - od.Discount)) AS TotalOrder
    FROM Orders o
    JOIN OrderDetails od 
    ON o.OrderID = od.OrderID
    JOIN Customers c
    ON o.CustomerID = c.CustomerID
    WHERE YEAR(OrderDate) = 2016
    GROUp BY o.CustomerID, c.CompanyName
)

SELECT CustomerID,
       CompanyName,
       TotalOrder,
       CustomerGroupName
FROM TotalOrderAmounts
JOIN CustomerGroupThresholds
ON TotalOrder BETWEEN RangeBottom AND RangeTop
ORDER BY CustomerID
""")

   CustomerID                         CompanyName    TotalOrder  \
0       ALFKI                 Alfreds Futterkiste   2250.499998
1       ANATR  Ana Trujillo Emparedados y helados    514.400002
2       ANTON             Antonio Moreno Taquería    660.000000
3       AROUT                     Around the Horn   5604.750000
4       BERGS                  Berglunds snabbköp   6754.162476
..        ...                                 ...           ...
76      WARTH                      Wartian Herkku    270.000000
77      WELLI              Wellington Importadora   1135.250000
78      WHITC                White Clover Markets  15278.899986
79      WILMK                         Wilman Kala   1987.000008
80      WOLZA                      Wolski  Zajazd   1865.099976

   CustomerGroupName
0             Medium
1                Low
2                Low
3               High
4               High
..               ...
76               Low
77            Medium
78         Very High
79            Medium
80            Medium

[81 rows x 4 columns]

## 52. Countries with Suppliers or Customers

In [14]:
sql("""
SELECT DISTINCT Country FROM Suppliers 
UNION 
SELECT DISTINCT Country FROM Customers
""")

        Country
0     Argentina
1     Australia
2       Austria
3       Belgium
4        Brazil
5        Canada
6       Denmark
7       Finland
8        France
9       Germany
10      Ireland
11        Italy
12        Japan
13       Mexico
14  Netherlands
15       Norway
16       Poland
17     Portugal
18    Singapore
19        Spain
20       Sweden
21  Switzerland
22           UK
23          USA
24    Venezuela

## 53. Countries with Suppliers or Customers, Version 2

In [22]:
sql("""
SELECT DISTINCT s.Country AS SupplierCountry,
                c.Country AS CustomerCountry 
FROM Suppliers s
FULL OUTER JOIN
(SELECT DISTINCT cs.Country From Customers cs) AS c 
ON s.Country = c.Country
""")

   SupplierCountry CustomerCountry
0             None       Argentina
1             None         Austria
2             None         Belgium
3             None         Ireland
4             None          Mexico
5             None          Poland
6             None        Portugal
7             None     Switzerland
8             None       Venezuela
9        Australia            None
10          Brazil          Brazil
11          Canada          Canada
12         Denmark         Denmark
13         Finland         Finland
14          France          France
15         Germany         Germany
16           Italy           Italy
17           Japan            None
18     Netherlands            None
19          Norway          Norway
20       Singapore            None
21           Spain           Spain
22          Sweden          Sweden
23              UK              UK
24             USA             USA

## 54. Countries with Suppliers or Customers, Version 3

In [29]:
sql("""
WITH SupplierCounts AS (
    SELECT Country, COUNT(*) AS TotalSuppliers
    FROM Suppliers
    GROUP BY Country
),
CustomerCounts AS (
    SELECT Country, COUNT(*) AS TotalCustomers
    FROM Customers
    GROUP BY Country
)

SELECT CASE WHEN s.Country IS NULL THEN c.Country ELSE s.Country END AS Country,
       CASE WHEN s.TotalSuppliers IS NULL THEN 0 ELSE CAST(s.TotalSuppliers AS Integer) END AS TotalSuppliers,
       CASE WHEN c.TotalCustomers IS NULL THEN 0 ELSE CAST(c.TotalCustomers AS Integer) END AS TotalCustomers
FROM SupplierCounts s
FULL OUTER JOIN CustomerCounts c
ON s.Country = c.Country
""")

        Country  TotalSuppliers  TotalCustomers
0     Argentina               0               3
1     Australia               2               0
2       Austria               0               2
3       Belgium               0               2
4        Brazil               1               9
5        Canada               2               3
6       Denmark               1               2
7       Finland               1               2
8        France               3              11
9       Germany               3              11
10      Ireland               0               1
11        Italy               2               3
12        Japan               2               0
13       Mexico               0               5
14  Netherlands               1               0
15       Norway               1               1
16       Poland               0               1
17     Portugal               0               2
18    Singapore               1               0
19        Spain               1               5
20       Sweden               2               2
21  Switzerland               0               2
22           UK               2               7
23          USA               4              13
24    Venezuela               0               4